Population vs Sample
- A population is the group of all items of interest. Ex: All the students on university campus
- A sample is a set of data drawn from the studied population. Ex: 500 students from the campus

Sampling
- Random Sampling
- Stratified Sampling

In [ ]:
#Random Sampling: Probability of each record being selected into your sample will be equal. 1/n

In [31]:
import pandas as pd
data=pd.read_csv('./course-content/data/redwines.csv')

In [32]:
data.describe()

,fixed_acidity,volatile_acidity,citric_acid,residual_sugar,chlorides,free_so2,total_so2,density,pH,sulphates,alcohol,quality
count,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000
mean,8.319637,0.527821,0.270976,2.538806,0.087467,15.874922,46.467792,0.996747,3.311113,0.658149,10.422983,5.636023
std,1.741096,0.179060,0.194801,1.409928,0.047065,10.460157,32.895324,0.001887,0.154386,0.169507,1.065668,0.807569
min,4.600000,0.120000,0.000000,0.900000,0.012000,1.000000,6.000000,0.990070,2.740000,0.330000,8.400000,3.000000
25%,7.100000,0.390000,0.090000,1.900000,0.070000,7.000000,22.000000,0.995600,3.210000,0.550000,9.500000,5.000000
50%,7.900000,0.520000,0.260000,2.200000,0.079000,14.000000,38.000000,0.996750,3.310000,0.620000,10.200000,6.000000
75%,9.200000,0.640000,0.420000,2.600000,0.090000,21.000000,62.000000,0.997835,3.400000,0.730000,11.100000,6.000000
max,15.900000,1.580000,1.000000,15.500000,0.611000,72.000000,289.000000,1.003690,4.010000,2.000000,14.900000,8.000000

In [33]:
import pandas as pd
data=pd.read_excel('sampling_data.xlsx',sheet_name='Binom')
data.head()

     Card_ID  Campaign_Responce Registration_Date Gender Birth_Date
0  100005950              False        1998-11-18      M 1984-02-06
1  100022191               True        1999-09-15      F 1959-09-11
2  100025442              False        1998-05-12      M 1970-08-25
3  100026513              False        1999-02-12      M 1951-03-12
4  100039145              False        2000-08-12      M 1949-06-08

In [34]:
data.shape

(297, 5)

In [35]:
type(data)

pandas.core.frame.DataFrame

- Random sampling without replacement: Repeatation of samples are not allowed.
- Random sampling with replacement: Repeatation of samples are allowed.

In [ ]:
#By default sample() method does, random sampling without replacement as 'replace=False'

In [36]:
#Select 5 records randomly from Binom.
df1=data.sample(n=5,random_state=8)
df1

       Card_ID  Campaign_Responce Registration_Date Gender Birth_Date
295  106542819              False        1999-06-10      M 1971-02-26
107  102506664               True        1998-04-25      F 1970-05-03
153  103454063              False        1999-09-26      M 1973-07-02
180  104018249              False        1998-01-27      F 1972-02-07
55   101215579              False        1998-06-23      M 1972-04-02

In [37]:
df1.index

Int64Index([295, 107, 153, 180, 55], dtype='int64')

In [38]:
df1['Campaign_Responce'].value_counts()

False    4
True     1
Name: Campaign_Responce, dtype: int64

In [39]:
#Select 10% of records randomly
df2=data.sample(frac=0.1,random_state=100)

In [40]:
df2.shape

(30, 5)

In [41]:
df2.index

Int64Index([220, 139, 223, 175, 229, 134, 128,  88,  27, 291, 169,   7, 242,
            195, 161,  18, 288, 216,  60, 294, 198, 237, 148, 281, 208, 194,
            209, 247, 112, 168],
           dtype='int64')

In [42]:
data['Campaign_Responce'].value_counts()

False    248
True      49
Name: Campaign_Responce, dtype: int64

In [43]:
df2['Campaign_Responce'].value_counts()

False    25
True      5
Name: Campaign_Responce, dtype: int64

In [44]:
#Select 10 records with replacement
df3=data.sample(n=10,replace=True)

In [45]:
df3

       Card_ID  Campaign_Responce Registration_Date Gender Birth_Date
99   102340220              False        1998-08-06      F 1981-08-05
162  103519519              False        2001-07-28      F 1967-04-15
242  105413289              False        2000-03-10      M 1976-01-21
78   101876851               True        1999-07-02      F 1930-07-25
103  102464771              False        1999-12-10      F 1967-03-10
284  106362278              False        2000-12-21      F 1960-07-28
49   100942262              False        1999-02-15      M 1947-05-08
256  105756169              False        2000-08-31      M 1959-06-27
111  102604443              False        1998-04-05      F 1955-11-20
143  103266933              False        1998-12-05      M 1956-04-30

In [ ]:
#Stratified Sampling

In [46]:
data.head()

     Card_ID  Campaign_Responce Registration_Date Gender Birth_Date
0  100005950              False        1998-11-18      M 1984-02-06
1  100022191               True        1999-09-15      F 1959-09-11
2  100025442              False        1998-05-12      M 1970-08-25
3  100026513              False        1999-02-12      M 1951-03-12
4  100039145              False        2000-08-12      M 1949-06-08

In [47]:
data.shape

(297, 5)

In [48]:
data['Gender'].value_counts()

M    170
F    127
Name: Gender, dtype: int64

In [49]:
data['Gender'].value_counts()/data.shape[0]

M    0.572391
F    0.427609
Name: Gender, dtype: float64

In [50]:
#Select 30% of records stratified according to Gender
from sklearn.model_selection import train_test_split

In [51]:
df1,df2=train_test_split(data,test_size=0.3,stratify=data['Gender'],random_state=1)

In [52]:
#Train
df1.shape[0]/data.shape[0]

0.696969696969697

In [53]:
#Test
df2.shape[0]/data.shape[0]

0.30303030303030304

In [54]:
df2.head()

       Card_ID  Campaign_Responce Registration_Date Gender Birth_Date
96   102328890              False        1998-12-05      M 1971-12-23
163  103551896              False        1999-08-30      M 1961-06-19
66   101350213               True        1999-11-09      M 1957-09-04
285  106371435              False        1999-06-25      F 1975-04-27
155  103460735              False        1999-05-09      F 1950-11-26

In [55]:
df2['Gender'].value_counts()/df2.shape[0]

M    0.577778
F    0.422222
Name: Gender, dtype: float64

In [56]:
df1['Gender'].value_counts()/df1.shape[0]

M    0.570048
F    0.429952
Name: Gender, dtype: float64